In [22]:
import pandas as pd

# Main Data types in Panda

In [5]:
#2. Main Datatypes --> Series and DataFrames
series = pd.Series(["BMW","TOYOTA","HONDA"])

In [32]:
series

0       BMW
1    TOYOTA
2     HONDA
dtype: object

In [8]:
# series ==> 1-Dimensional

In [9]:
colors = pd.Series(["RED","BLUE","YELLOW"])
colors

0       RED
1      BLUE
2    YELLOW
dtype: object

In [12]:
#DataFrame - 2-Dimensional
car_data = pd.DataFrame({"Car Make": series , "Color ":colors})
car_data

  Car Make  Color
0      BMW     RED
1   TOYOTA    BLUE
2    HONDA  YELLOW

In [14]:
# Import Data
car_sale = pd.read_csv("car-sales.csv")
car_sale

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [18]:
#Exporting a Data Frame
car_sale.to_csv("exported-car-sales.csv")

In [20]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

# Describe Data

In [23]:
#Attribute      ---> don't has () brackets 
car_sale.dtypes  

#Functions      ---> Does Have () Brackets
#car_sale.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [24]:
car_sale.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [26]:
car_columns = car_sale.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [28]:
car_sale.index

RangeIndex(start=0, stop=10, step=1)

In [30]:
car_sale.describe()     ## describe() --> Only Applicable on integer types

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [31]:
car_sale.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [33]:
car_sale.mean()

C:\Users\Administrator\AppData\Local\Temp\ipykernel_12764\4002175586.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  car_sale.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [34]:
car_sale.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [37]:
car_sale.Doors.sum()

40

In [38]:
len(car_sale)

10

# Viewing and selecting data

In [44]:
car_sale.head()   # head() ---> Returns First 5 Rows of the Data Frame

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [42]:
car_sale.tail()  # tail() ---> Returns bottom 5 Rows of the Data Frame

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [45]:
car_sale.head(8)  # head(no_of_rows) ---> Returns top <no_of_rows> Rows of the Data Frame

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00

In [49]:
# .loc  &  .iloc
animals = pd.Series(["cat","dog","panda","panda","snake"],
                   index=[0, 3, 9 , 8, 3])

In [50]:
animals

0      cat
3      dog
9    panda
8    panda
3    snake
dtype: object

In [51]:
animals.loc[3]     # .loc[] ---> Refers to the Index

3      dog
3    snake
dtype: object

In [52]:
animals.loc[9]

'panda'

In [53]:
car_sale.loc[1]

Make                 Honda
Colour                 Red
Odometer (KM)        87899
Doors                    4
Price            $5,000.00
Name: 1, dtype: object

In [54]:
# .iloc    
animals.iloc[3]      # .iloc[] ---> Refers to the position

'panda'

In [55]:
car_sale.iloc[::-1]    # We can Do Slicing in loc & iloc just like python lists

     Make Colour  Odometer (KM)  Doors       Price
9  Nissan  White          31600      4   $9,700.00
8  Toyota  White          60000      4   $6,250.00
7   Honda   Blue          54738      4   $7,000.00
6   Honda   Blue          45698      4   $7,500.00
5  Toyota  Green          99213      4   $4,500.00
4  Nissan  White         213095      4   $3,500.00
3     BMW  Black          11179      5  $22,000.00
2  Toyota   Blue          32549      3   $7,000.00
1   Honda    Red          87899      4   $5,000.00
0  Toyota  White         150043      4   $4,000.00

In [59]:
# One more way to select data

car_sale[car_sale.Make=="Toyota"][:3]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00